<template>
  <div>
    <md-steppers md-vertical>
      <md-step id="first" md-label="First Step" md-description="阅读协议">
        <h3>第一章 总则</h3>
        <p>
          (一) 中航共赢网是中航国际航空发展有限公司创建的电子商务采购平台、项目管理和供应商管理平台。
          中航共赢网目前服务于航空企业及产
          业链的所有相关用户。
        </p>
        <p>(二) 中航共赢网采用会员制管理，为入会的会员提供基本会员服务。</p>
        <p>
          (三) 中航共赢网是中国制造装备国际引进的采购平台，其功能包括：设备的招投标信息发布、进口采购业务协同、企业信息发布、产品搜集
          和归类发布、供应商管理等功能。
        </p>
        <h3>第二章 入会和退会</h3>
        <p>
          (六) 凡承认本章程、合法经营的国内外独立实体、法人单位及政府机关均可注册成为中航共赢网会员，注册信息经过网站管理员审批，即时
          生效。
        </p>
        <p>
          (七) 有下列情况之一的，被视为自动退会：
          1. 自愿书面申请退会的；
          2. 会员企业被宣布破产的；
        </p>
        <h3>第三章 网站服务和会员权利和义务</h3>
        <p>(九) 中航共赢网通过互联网依法为会员提供互联网信息等服务，会员在完全同意本协议及本站规定的情况下，方有权使用本站的相关服务；</p>
        <p>
          (十) 中航共赢网会员享有以下权利:
          1. 使用中航共赢网开放的服务；
          2. 自由退会的权利；
          3. 对其他会员侵犯自己权利行为向中航共赢网进行投诉的权利；
          4. 在中航共赢网上发布企业和产品信息，由中航共赢网保存该等企业和产品信息；
          5. 经过申请，使用网站的增值服务；
        </p>
        <p>
          (十一) 会员的义务
          1. 遵守本会员章程、交易规则、中航共赢网有关管理规定和入会协议，接受中航共赢网的会员资格定期审查；
          2. 遵守《中华人民共和国民法通则》、《中华人民共和国合同法》、《中华人民共和国广告法》、《互联网信息服务管理办法》及《消费者权
          益保护法》等法律行政规章，尊重中国的道德规范和民俗风情；
          3. 凡中华人民共和国法律规定禁止流通的物品和服务，不得通过网络交易方式进行；限制流通及涉及不动产、证券交易和其他交易，必须遵守
          国家有关规定；
          4. 保守国家秘密，尊重个人隐私，尊重并保护知识产权；
        </p>
        <h3>第四章 所有权及知识产权条款</h3>
        <p>
          (十六) 会员一旦接受本协议，即表明该会员主动将其在任何时间段在本站发表的任何形式的信息内容的财产性权利等任何可转让的权利，如
          著作权财产权（包括并不限于：复制权、发行权、出租权、展览权、表演权、放映权、广播权、信息网络传播权、摄制权、改编权、翻译权、
          汇编权以及应当由著作权人享有的其他可转让权利），全部独家且不可撤销地转让给中航共赢网所有，会员同意中航共赢网有权就任何主体
          侵权而单独提起诉讼。
        </p>
        <p>
          本协议已经构成《中华人民共和国著作权法》第二十五条（条文序号依照2011年版著作权法确定）及相关法律规定的著作财产权等
          权利转让书面协议，其效力及于会员在中航共赢网网站上发布的任何受著作权法保护的作品内容，无论该等内容形成于本协议订立前还是本
          协议订立后。
        </p>
        <p>
          (十一) 会员的义务
          1. 遵守本会员章程、交易规则、中航共赢网有关管理规定和入会协议，接受中航共赢网的会员资格定期审查；
          2. 遵守《中华人民共和国民法通则》、《中华人民共和国合同法》、《中华人民共和国广告法》、《互联网信息服务管理办法》及《消费者权
          益保护法》等法律行政规章，尊重中国的道德规范和民俗风情；
          3. 凡中华人民共和国法律规定禁止流通的物品和服务，不得通过网络交易方式进行；限制流通及涉及不动产、证券交易和其他交易，必须遵守
          国家有关规定；
          4. 保守国家秘密，尊重个人隐私，尊重并保护知识产权；
        </p>
      </md-step>

      <md-step id="second" md-label="Second Step" md-description="填写入会申请">
        <member-join-us-form/>
      </md-step>

      <md-step id="third" md-label="Third Step">
        <div>
          <md-empty-state
           md-icon="done"
            md-label="您的入会申请已经发送"
            md-description="请您及时查询邮箱或添加微信号管理员直接交流"
          >
            <md-button class="md-primary md-raised">获取微信号</md-button>
          </md-empty-state>
        </div>
      </md-step>
    </md-steppers>
  </div>
</template>

<script>
import MemberJoinUsForm from "~/components/members/MemberJoinUsForm.vue";
export default {
  name: "StepperVertical",
  components: {
    MemberJoinUsForm
  }
};
</script>

<style>
h3 {
  margin-top: 2%;
}

p {
  margin: 1%;
}
</style>
